//
//  Keys.swift
//  vibolKeyboard
//
//  Created by Vibol's Macbook Pro on 11/21/18.
//  Copyright © 2018 Vibol Roeun. All rights reserved.
//

import Foundation


class KeysButtton {
    
    let primaryUpKeys = ["ឈ", "ឹ", "ែ", "ឬ", "ទ", "ួ", "ូ", "ី", "ៅ", "ភ", "ាំ", "ៃ", "ឌ", "ធ", "អ", "ះ", "ៈ", "គ", "ឡ", "៉", "ឍ", "ឃ", "ជ", "េះ", "ព", "ណ", "ំ", "ុះ", "ឿ", "ោះ" ]
    let upkeys = [" ្ឈ", "", "", "", "  ្ទ", "", "", "", "", "  ្ភ", "", "", "  ្ឌ", "  ្ធ", "  ្អ", "", "", "  ្គ", "  ្ឡ", "", "  ្ឍ", "  ្ឃ", "  ្ជ", "", "  ្ព", "  ្ណ", "", "", "", "" ]
    let primaryBottomKeys = ["ឆ", "ឺ", "េ", "រ", "ត", "យ", "ុ", "ិ", "ោ", "ផ", "ា", "ស", "ដ", "ថ", "ង", "ហ", "ញ", "ក", "ល", "់", "ឋ", "ខ", "ច", "វ", "ប", "ន", "ម", "ុំ", "ៀ", "ើ" ]
    
    let secondUpKeys = ["១", "២", "៣", "៤", "៥", "៦", "៧", "៨", "៩", "០", "1", "2", "3", "4", "5", "6", "7", "8", "9", "0", "ឲ", "@", "#", "$", "%", "'\'", "&", "*", "(", ")" ]
    
    let secondBottomKeys = ["!", "ៗ", "៖", "៛", "៎", "៍", "័", "៏", "៌", "៊", "ឥ", "ឦ", "ឧ", "ឱ", "ឪ", "ឫ", "ឬ", "ឭ", "ឮ", "ឯ", "ឱ", ".", ",", ":", "+", "-", "_", "/", "|", "៕" ]
    
    
}


